nordic-auko/nRF5-ble-timesync-demo/nRF5_SDK_16.0.0_98a08e2/examples/common/time_sync.c
/**
 * Copyright (c) 2014 - 2017, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "time_sync.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>

#include "app_error.h"
#include "app_util_platform.h"
#include "nrf.h"
#include "nrf_gpio.h"
#include "nrf_assert.h"
#include "nrf_atomic.h"
#include "nrf_balloc.h"
#include "nrf_error.h"
#include "nrfx_ppi.h"
#include "nrf_soc.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdm.h"

#define NRF_LOG_MODULE_NAME time_sync
#define NRF_LOG_LEVEL 4
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#if   defined ( __CC_ARM )
#define TX_CHAIN_DELAY_PRESCALER_0 (699 - 235)
#elif defined ( __ICCARM__ )
#define TX_CHAIN_DELAY_PRESCALER_0 (703 - 235)
#elif defined ( __GNUC__ )
#define TX_CHAIN_DELAY_PRESCALER_0 (704 - 237)
#endif

#define SYNC_TIMER_PRESCALER 0
#define SYNC_RTC_PRESCALER 0

#if SYNC_TIMER_PRESCALER == 0
#define TX_CHAIN_DELAY TX_CHAIN_DELAY_PRESCALER_0
#else
#error Invalid prescaler value
#endif

#if TIME_SYNC_TIMER_MAX_VAL < 10000
#error Timer values below 10000 not supported
#endif

static void ts_on_sys_evt(uint32_t sys_evt, void * p_context);

NRF_SDH_SOC_OBSERVER(timesync_soc_obs,     \
                     TS_SOC_OBSERVER_PRIO, \
                     ts_on_sys_evt, 0);

#define TS_LEN_US                            (1000UL)
#define TX_LEN_EXTENSION_US                  (1000UL)
#define TS_SAFETY_MARGIN_US                  (500UL)   /**< The timeslot activity should be finished with this much to spare. */
#define TS_EXTEND_MARGIN_US                  (700UL)   /**< The timeslot activity should request an extension this long before end of timeslot. */


#define MAIN_DEBUG                           0x12345678UL

static void ppi_sync_timer_adjust_configure(bool shorten);
static void ppi_sync_timer_adjust_enable(void);
static void ppi_sync_timer_clear_configure(void);
static void ppi_sync_timer_clear_disable(void);
static void ppi_radio_rx_disable(void);
static void ppi_radio_rx_configure(void);
static void ppi_radio_tx_configure(void);
static uint32_t ppi_sync_trigger_configure(uint32_t ppi_endpoint);

typedef struct
{
    uint8_t                 rf_chn;          /** RF Channel [0-80] */
    uint8_t                 rf_addr[5];      /** 5-byte RF address */
    nrf_ppi_channel_t       ppi_chns[7];     /** PPI channels */
    nrf_ppi_channel_group_t ppi_chgs[2];        /** PPI Channel Groups */
    NRF_TIMER_Type *        high_freq_timer[2]; /** 16 MHz timer (e.g. NRF_TIMER2). NOTE: debug toggling only available if TIMER3 or TIMER4 is used for high_freq_timer[0]*/
    NRF_EGU_Type   *        egu;
    IRQn_Type               egu_irq_type;
} ts_params_t;

typedef PACKED_STRUCT
{
    int32_t  timer_val;
    int32_t  rtc_val;
    uint32_t counter_val;
} sync_pkt_t;

static uint8_t          m_sync_pkt_ringbuf[10][sizeof(sync_pkt_t)];
static nrf_atomic_u32_t m_sync_pkt_ringbuf_idx;

static nrf_atomic_flag_t m_timeslot_session_open;
static nrf_atomic_flag_t m_pending_close;
static nrf_atomic_flag_t m_pending_tx_stop;
static nrf_atomic_u32_t  m_blocked_cancelled_count;
static uint32_t          m_total_timeslot_length = 0;
static uint32_t          m_timeslot_distance = 0;
static uint32_t          m_tx_slot_retry_count = 0;
static uint32_t          m_usec_since_sync_packet = 0;
static uint32_t          m_usec_since_tx_offset_calc = 0;
static ts_params_t       m_params;

static nrf_atomic_flag_t m_send_sync_pkt = false;
static nrf_atomic_flag_t m_timer_update_in_progress = false;

static bool m_synchronized = false;

static volatile int64_t  m_master_counter_diff = 0;
static nrf_atomic_u32_t  m_rcv_count      = 0;

static nrf_atomic_u32_t  mp_curr_adj_pkt;
static nrf_atomic_u32_t  m_curr_adj_timer;
static nrf_atomic_u32_t  m_curr_adj_counter;

static ts_evt_handler_t m_callback;
static nrf_atomic_u32_t m_tick_target;
static nrf_atomic_u32_t m_sync_packet_count = 0;
static nrf_atomic_u32_t m_used_packet_count = 0;
static nrf_atomic_u32_t m_last_sync = 0;

static nrf_ppi_channel_t m_timestamp_trigger_ppi[2];
static bool m_timestamp_trigger_set = false;

