nordic-auko/nRF5-ble-timesync-demo/nRF5_SDK_16.0.0_98a08e2/examples/common/time_sync.c
    bool shorten_cycle = timer_offset < 0;

    m_params.high_freq_timer[0]->CC[2] = TIME_SYNC_TIMER_MAX_VAL + timer_offset;
    ppi_sync_timer_adjust_configure(shorten_cycle);

    nrf_atomic_u32_fetch_store(&mp_curr_adj_pkt, (uint32_t) p_pkt);

    nrf_atomic_u32_store(&m_curr_adj_timer, m_params.high_freq_timer[0]->CC[1]);
    nrf_atomic_u32_store(&m_curr_adj_counter, m_params.high_freq_timer[1]->CC[1]);

    uint32_t cc_val;

    do
    {
        // Avoid race condition when disabling and re-enabling PPI channel very quickly
        m_params.high_freq_timer[0]->TASKS_CAPTURE[4] = 1;
        cc_val = m_params.high_freq_timer[0]->CC[4];
    } while ((cc_val > (TIME_SYNC_TIMER_MAX_VAL - 15)));

    if (shorten_cycle)
    {
        m_params.high_freq_timer[0]->CC[0] = TIME_SYNC_TIMER_MAX_VAL + 10;
        ppi_sync_timer_adjust_enable();
    }
    else
    {
        ppi_sync_timer_adjust_enable();
        ppi_sync_timer_clear_disable();
    }

    return true;
}

static void ppi_sync_timer_adjust_configure(bool shorten)
{
    uint32_t chn0, chn1, chn2, chg0, chg1;

    chn0 = m_params.ppi_chns[0];
    chn1 = m_params.ppi_chns[1];
    chn2 = m_params.ppi_chns[6];
    chg0  = m_params.ppi_chgs[0];
    chg1  = m_params.ppi_chgs[1];

    // PPI channel 0: clear timer when compare[2] value is reached
    NRF_PPI->CHENCLR        = (1 << chn0);
    NRF_PPI->CH[chn0].EEP   = (uint32_t) &m_params.high_freq_timer[0]->EVENTS_COMPARE[2];
    NRF_PPI->CH[chn0].TEP   = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CLEAR;

    if (shorten)
    {
        NRF_PPI->FORK[chn0].TEP = (uint32_t) &m_params.high_freq_timer[1]->TASKS_COUNT;
    }
    else
    {
        NRF_PPI->FORK[chn0].TEP = 0;
    }

    // PPI channel 1: disable PPI channel 0 such that the timer is only reset once, and trigger software interrupt
    NRF_PPI->CHENCLR        = (1 << chn1);
    NRF_PPI->CH[chn1].EEP   = (uint32_t) &m_params.high_freq_timer[0]->EVENTS_COMPARE[2];
    NRF_PPI->CH[chn1].TEP   = (uint32_t) &NRF_PPI->TASKS_CHG[chg0].DIS;	// disable PPI group
    NRF_PPI->FORK[chn1].TEP = (uint32_t) &m_params.egu->TASKS_TRIGGER[0]; // trigger EGU interrupt

    if (shorten)
    {
        NRF_PPI->CHENCLR        = (1 << chn2);
        NRF_PPI->CH[chn2].EEP   = 0;
        NRF_PPI->CH[chn2].TEP   = 0;
    }
    else
    {
        // PPI channel 2: Re-enable EVENTS_COMPARE[0] after lengthening cycle
        NRF_PPI->CHENCLR        = (1 << chn2);
        NRF_PPI->CH[chn2].EEP   = (uint32_t) &m_params.high_freq_timer[0]->EVENTS_COMPARE[2];
        NRF_PPI->CH[chn2].TEP   = (uint32_t) &NRF_PPI->TASKS_CHG[chg1].EN;	// enable PPI group
    }

    NRF_PPI->TASKS_CHG[chg0].DIS = 1;
    NRF_PPI->CHG[chg0]           = (1 << chn0) | (1 << chn1) | (1 << chn2);
}

static void ppi_radio_rx_configure(void)
{
    uint32_t chn;

    chn = m_params.ppi_chns[2];

    NRF_PPI->CH[chn].EEP   = (uint32_t) &NRF_RADIO->EVENTS_ADDRESS;
    NRF_PPI->CH[chn].TEP   = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CAPTURE[1];
    NRF_PPI->FORK[chn].TEP = (uint32_t) &m_params.high_freq_timer[1]->TASKS_CAPTURE[1];
    NRF_PPI->CHENSET       = (1 << chn);
}

static void ppi_radio_tx_configure(void)
{
    uint32_t chn;

    chn = m_params.ppi_chns[0];

    NRF_PPI->CH[chn].EEP   = (uint32_t) &NRF_RADIO->EVENTS_READY;
    NRF_PPI->CH[chn].TEP   = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CAPTURE[1];
    NRF_PPI->FORK[chn].TEP = (uint32_t) &m_params.high_freq_timer[1]->TASKS_CAPTURE[1];
    NRF_PPI->CHENSET       = (1 << chn);
}

static void ppi_timestamp_timer_configure(void)
{
    uint32_t chn;

    chn = m_params.ppi_chns[3];

    NRF_PPI->CH[chn].EEP   = (uint32_t) &m_params.high_freq_timer[0]->EVENTS_COMPARE[0];
    NRF_PPI->CH[chn].TEP   = (uint32_t) &m_params.high_freq_timer[1]->TASKS_COUNT;
    NRF_PPI->FORK[chn].TEP = 0;
    NRF_PPI->CHENSET       = (1 << chn);
}

static void ppi_counter_timer_capture_configure(uint32_t chn)
{
    NRF_PPI->CH[chn].EEP    = (uint32_t) &m_params.egu->EVENTS_TRIGGERED[1];
    NRF_PPI->CH[chn].TEP    = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CAPTURE[3];
    NRF_PPI->FORK[chn].TEP  = (uint32_t) &m_params.high_freq_timer[1]->TASKS_CAPTURE[0];
    NRF_PPI->CHENSET        = (1 << chn);
}

static void ppi_counter_timer_triggered_capture_configure(nrf_ppi_channel_t chn[2], uint32_t eep)
{
    NRF_PPI->CH[chn[0]].EEP    = eep;
    NRF_PPI->CH[chn[0]].TEP    = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CAPTURE[5];
    NRF_PPI->FORK[chn[0]].TEP  = (uint32_t) &m_params.high_freq_timer[1]->TASKS_CAPTURE[5];

    NRF_PPI->CH[chn[1]].EEP    = eep;
    NRF_PPI->CH[chn[1]].TEP    = (uint32_t) &m_params.egu->TASKS_TRIGGER[5];
    NRF_PPI->FORK[chn[1]].TEP  = 0;

    NRF_PPI->CHENSET        = (1 << chn[0]) | (1 << chn[1]);
}

static void ppi_counter_timer_capture_disable(uint32_t chn)
{
    NRF_PPI->CHENCLR = (1 << chn);

    NRF_PPI->CH[chn].EEP    = 0;
    NRF_PPI->CH[chn].TEP    = 0;
    NRF_PPI->FORK[chn].TEP  = 0;
}

static void ppi_radio_rx_disable(void)
{
    uint32_t chn;

    chn = m_params.ppi_chns[2];

    NRF_PPI->CHENCLR = (1 << chn);
}

static void ppi_sync_timer_adjust_enable(void)
{
    NRF_PPI->TASKS_CHG[m_params.ppi_chgs[0]].EN = 1;
}

static void ppi_sync_timer_clear_configure(void)
{
    uint32_t chn;
    uint32_t chg;

    chn = m_params.ppi_chns[5];
    chg = m_params.ppi_chgs[1];

    NRF_PPI->CHENCLR        = (1 << chn);
    NRF_PPI->CH[chn].EEP   = (uint32_t) &m_params.high_freq_timer[0]->EVENTS_COMPARE[0];
    NRF_PPI->CH[chn].TEP   = (uint32_t) &m_params.high_freq_timer[0]->TASKS_CLEAR;
    NRF_PPI->CHENSET        = (1 << chn);

    NRF_PPI->CHG[chg]           = (1 << chn);
    NRF_PPI->TASKS_CHG[chg].EN = 1;
}

static void ppi_sync_timer_clear_disable(void)
{
    NRF_PPI->TASKS_CHG[m_params.ppi_chgs[1]].DIS = 1;
}

uint32_t ppi_sync_trigger_configure(uint32_t ppi_endpoint)
{
    uint32_t error;

    error = nrfx_ppi_channel_assign(m_params.ppi_chns[4], (uint32_t) &m_params.high_freq_timer[1]->EVENTS_COMPARE[4], ppi_endpoint);
    if (error != NRF_SUCCESS)
    {
        return error;
    }

    return nrfx_ppi_channel_fork_assign(m_params.ppi_chns[4], (uint32_t) &m_params.egu->TASKS_TRIGGER[2]);
}

static void timers_capture(uint32_t * p_sync_timer_val, uint32_t * p_count_timer_val, int32_t * p_peer_counter_diff)
{
    static nrf_atomic_flag_t m_timestamp_capture_flag = 0;

    volatile int32_t peer_counter_diff;

