nordic-auko/nRF5-ble-timesync-demo/nRF5_SDK_16.0.0_98a08e2/examples/common/time_sync.c
    if (nrf_atomic_flag_set_fetch(&m_timestamp_capture_flag) != 0)
    {
        // Not thread-safe
        APP_ERROR_CHECK_BOOL(false);
    }

    nrf_ppi_channel_t ppi_chn;
    nrfx_err_t ret = nrfx_ppi_channel_alloc(&ppi_chn);
    APP_ERROR_CHECK_BOOL(ret == NRFX_SUCCESS);

    ppi_counter_timer_capture_configure(ppi_chn);

    // Loop if adjustment procedure happened close to timer capture
    do
    {
        NVIC_DisableIRQ(m_params.egu_irq_type);

        m_params.egu->EVENTS_TRIGGERED[1] = 0;
        m_params.egu->TASKS_TRIGGER[1] = 1;
        while (m_params.egu->EVENTS_TRIGGERED[1] == 0)
        {
            __NOP();
        }

        peer_counter_diff = m_master_counter_diff;

        NVIC_EnableIRQ(m_params.egu_irq_type);
    } while (m_params.high_freq_timer[0]->CC[3] < 2);


    ppi_counter_timer_capture_disable(ppi_chn);
    nrfx_ppi_channel_free(ppi_chn);

    *p_sync_timer_val = m_params.high_freq_timer[0]->CC[3];
    *p_count_timer_val = (m_params.high_freq_timer[1]->CC[0]);
    *p_peer_counter_diff = peer_counter_diff;

    nrf_atomic_flag_clear(&m_timestamp_capture_flag);
}

uint32_t ts_init(const ts_init_t * p_init)
{
    nrfx_err_t ret;

    if (p_init->high_freq_timer[0] == 0 ||
        p_init->high_freq_timer[1] == 0 ||
        p_init->egu                == 0 ||
        p_init->evt_handler        == 0)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    memcpy(m_params.high_freq_timer, p_init->high_freq_timer, sizeof(m_params.high_freq_timer));
    m_params.egu = p_init->egu;
    m_params.egu_irq_type = p_init->egu_irq_type;
    m_callback = p_init->evt_handler;

    for (size_t i = 0; i < sizeof(m_params.ppi_chgs) / sizeof(m_params.ppi_chgs[0]); i++)
    {
        ret = nrfx_ppi_group_alloc(&m_params.ppi_chgs[i]);
        if (ret != NRFX_SUCCESS)
        {
            return NRF_ERROR_INTERNAL;
        }
        NRF_LOG_INFO("PPI CHG[%d]=%d", i, m_params.ppi_chgs[i]);
    }

    for (size_t i = 0; i < sizeof(m_params.ppi_chns) / sizeof(m_params.ppi_chns[0]); i++)
    {
        ret = nrfx_ppi_channel_alloc(&m_params.ppi_chns[i]);
        if (ret != NRFX_SUCCESS)
        {
            return NRF_ERROR_INTERNAL;
        }
        NRF_LOG_INFO("PPI CH[%d]=%d", i, m_params.ppi_chns[i]);
    }

    if (m_params.egu != NRF_EGU3)
    {
        // TODO: Remove hardcoded use of SWI3_EGU3_IRQHandler()
        return NRF_ERROR_INVALID_PARAM;
    }

    // TODO: Implement use of RTC as a low-power (and lower accuracy)
    // alternative to 16 MHz TIMER
    // if (SYNC_RTC_PRESCALER != m_params.rtc->PRESCALER)
    // {
    //     // TODO: Handle this
    //     return NRF_ERROR_INVALID_STATE;
    // }

    return NRF_SUCCESS;
}

uint32_t ts_enable(const ts_rf_config_t* p_rf_config)
{
    uint32_t err_code;

    if (p_rf_config == NULL || p_rf_config->rf_addr == NULL)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    if (m_timeslot_session_open)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    err_code = sd_clock_hfclk_request();
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    err_code |= sd_power_mode_set(NRF_POWER_MODE_CONSTLAT);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    memcpy(m_params.rf_addr, p_rf_config->rf_addr, sizeof(m_params.rf_addr));
    m_params.rf_chn = p_rf_config->rf_chn;

    err_code = sd_radio_session_open(radio_callback);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    err_code = sd_radio_request(&m_timeslot_req_earliest);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    ppi_timestamp_timer_configure();

    NVIC_ClearPendingIRQ(m_params.egu_irq_type);
    NVIC_SetPriority(m_params.egu_irq_type, TIME_SYNC_EVT_HANDLER_IRQ_PRIORITY);
    NVIC_EnableIRQ(m_params.egu_irq_type);

    m_params.egu->INTENCLR = 0xFFFFFFFF;
    m_params.egu->INTENSET = EGU_INTENSET_TRIGGERED0_Msk | EGU_INTENSET_TRIGGERED2_Msk | EGU_INTENSET_TRIGGERED3_Msk | EGU_INTENSET_TRIGGERED4_Msk | EGU_INTENSET_TRIGGERED5_Msk;

    m_blocked_cancelled_count  = 0;
    m_radio_state              = RADIO_STATE_IDLE;

    nrf_atomic_flag_clear(&m_send_sync_pkt);

    timestamp_counter_start();
    ppi_sync_timer_clear_configure();
    sync_timer_start();

    nrf_atomic_flag_set(&m_timeslot_session_open);

    return NRF_SUCCESS;
}

uint32_t ts_disable(void)
{
    uint32_t err_code;

    nrf_atomic_flag_set(&m_pending_close);

    err_code = sd_radio_session_close();
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // TODO: stop timer

    err_code = sd_clock_hfclk_release();
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    err_code |= sd_power_mode_set(NRF_POWER_MODE_LOWPWR);
    if (err_code != NRF_SUCCESS)
    {
        return err_code;
    }

    // TODO:
    //       - Close SoftDevice radio session (sd_radio_session_close())
    //       - Stop radio activity
    //       - Stop timers
    //       - Disable used PPI channels
    //       - Disable used interrupts
    //       - Release HFCLK (sd_clock_hfclk_release()),
    //       - Go back to low-power (mode sd_power_mode_set(NRF_POWER_MODE_LOWPWR))
    // Care must be taken to ensure clean stop. Order of tasks above should be reconsidered.
    return NRF_SUCCESS;
}

uint32_t ts_tx_start(uint32_t sync_freq_hz)
{
    uint32_t distance;

    if (sync_freq_hz == TIME_SYNC_FREQ_AUTO)
    {
        // 20-30 Hz is a good range
        // Higher frequency gives more margin for missed packets, but doesn't improve accuracy that much
        uint32_t auto_freq_target = 30;
        distance = (ROUNDED_DIV(ROUNDED_DIV(1000000, auto_freq_target), (TIME_SYNC_TIMER_MAX_VAL / 16))) * (TIME_SYNC_TIMER_MAX_VAL / 16);
    }
    else
    {
        distance = (1000000 / sync_freq_hz);
    }

    if (distance >= NRF_RADIO_DISTANCE_MAX_US)
    {
        return NRF_ERROR_INVALID_PARAM;
    }

    m_timeslot_distance = distance;
    m_usec_since_tx_offset_calc = 0;

    nrf_atomic_flag_set(&m_send_sync_pkt);

    return NRF_SUCCESS;
}

uint32_t ts_tx_stop()
{
    nrf_atomic_flag_set(&m_pending_tx_stop);

    return NRF_SUCCESS;
}

uint32_t ts_timestamp_get_ticks_u32(void)
{
    uint32_t sync_timer_val;
    uint32_t count_timer_val;
    int32_t peer_diff;

    timers_capture(&sync_timer_val, &count_timer_val, &peer_diff);

    return (((count_timer_val + peer_diff) * TIME_SYNC_TIMER_MAX_VAL) + sync_timer_val);
}

uint64_t ts_timestamp_get_ticks_u64(void)
{
    uint32_t sync_timer_val;
    uint32_t count_timer_val;
    uint64_t timestamp;
    int32_t  peer_diff;

    timers_capture(&sync_timer_val, &count_timer_val, &peer_diff);

    timestamp  = (uint64_t) count_timer_val;
    timestamp += (uint64_t) peer_diff;
    timestamp *= TIME_SYNC_TIMER_MAX_VAL;
    timestamp += (uint64_t) sync_timer_val;

    return timestamp;
}
